In [3]:
import pandas as pd
sales_final=pd.read_csv('./data fsds/sales_data_final.csv')
sales_final.head()  # SHows topmost 5 data entries
sales_final.tail() # Shows buttommost 5 records
sales_final.columns # Shows all the columns
sales_final.order_date
sales_final[['order_date','year']] # If you want to fetch more than one row you have to do it like this. wrapping it under single square brackets throws you an error

       order_date  year
0        1/1/2011  2011
1        1/1/2011  2011
2        1/1/2011  2011
3        1/1/2011  2011
4        1/1/2011  2011
...           ...   ...
51285  12/31/2014  2014
51286  12/31/2014  2014
51287  12/31/2014  2014
51288  12/31/2014  2014
51289  12/31/2014  2014

[51290 rows x 2 columns]

In [12]:
print(sales_final['year'],sales_final[['year']])
print(type(sales_final['year']),type(sales_final[['year']]))

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
51285    2014
51286    2014
51287    2014
51288    2014
51289    2014
Name: year, Length: 51290, dtype: int64        year
0      2011
1      2011
2      2011
3      2011
4      2011
...     ...
51285  2014
51286  2014
51287  2014
51288  2014
51289  2014

[51290 rows x 1 columns]
<class 'pandas.core.series.Series'> <class 'pandas.core.frame.DataFrame'>

In [13]:
sales_final.describe() # Returns a df containing basic sstatistical analysis on the numeric columns

           quantity      discount        profit  shipping_cost          year
count  51290.000000  51290.000000  51290.000000   51290.000000  51290.000000
mean       3.476545      0.142908     28.641740      26.375915   2012.777208
std        2.278766      0.212280    174.424113      57.296804      1.098931
min        1.000000      0.000000  -6599.978000       0.000000   2011.000000
25%        2.000000      0.000000      0.000000       2.610000   2012.000000
50%        3.000000      0.000000      9.240000       7.790000   2013.000000
75%        5.000000      0.200000     36.810000      24.450000   2014.000000
max       14.000000      0.850000   8399.976000     933.570000   2014.000000

In [14]:
sales_final.dtypes

order_id           object
order_date         object
ship_date          object
ship_mode          object
customer_name      object
segment            object
state              object
country            object
market             object
region             object
product_id         object
category           object
sub_category       object
product_name       object
sales              object
quantity            int64
discount          float64
profit            float64
shipping_cost     float64
order_priority     object
year                int64
dtype: object

In [15]:
sales_final.dtypes=='object'

order_id           True
order_date         True
ship_date          True
ship_mode          True
customer_name      True
segment            True
state              True
country            True
market             True
region             True
product_id         True
category           True
sub_category       True
product_name       True
sales              True
quantity          False
discount          False
profit            False
shipping_cost     False
order_priority     True
year              False
dtype: bool

In [16]:
sales_final.dtypes[sales_final.dtypes=='object']

order_id          object
order_date        object
ship_date         object
ship_mode         object
customer_name     object
segment           object
state             object
country           object
market            object
region            object
product_id        object
category          object
sub_category      object
product_name      object
sales             object
order_priority    object
dtype: object

In [19]:
sales_final[sales_final.dtypes[sales_final.dtypes=='object'].index].describe()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,product_id,category,sub_category,product_name,sales,order_priority
count,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290
unique,25035,1430,1464,4,795,3,1094,147,7,13,10292,3,17,3788,2246,4
top,CA-2014-100111,6/18/2014,11/22/2014,Standard Class,Muhammed Yedwab,Consumer,California,United States,APAC,Central,OFF-AR-10003651,Office Supplies,Binders,Staples,13,Medium
freq,14,135,130,30775,108,26518,2001,9994,11002,11117,35,31273,6152,227,589,29433

In [25]:
sales_final[sales_final.dtypes[sales_final.dtypes=='float64'].index].describe()

           discount        profit  shipping_cost
count  51290.000000  51290.000000   51290.000000
mean       0.142908     28.641740      26.375915
std        0.212280    174.424113      57.296804
min        0.000000  -6599.978000       0.000000
25%        0.000000      0.000000       2.610000
50%        0.000000      9.240000       7.790000
75%        0.200000     36.810000      24.450000
max        0.850000   8399.976000     933.570000

In [10]:
sales_final['category2']='Trial'
# This way you can add new columns

In [9]:
sales_final['converted_date']=pd.to_datetime(sales_final['order_date'])
sales_final['converted_date'].dt.year

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
51285    2014
51286    2014
51287    2014
51288    2014
51289    2014
Name: converted_date, Length: 51290, dtype: int64

In [34]:
# Find the most profitable customer
sales_final[sales_final['profit']==sales_final['profit'].max()]['customer_name']

29530    Tamara Chand
Name: customer_name, dtype: object

In [85]:

sales_final['order_date_month']=sales_final['converted_date'].dt.month
sales_final['converted_date'].dt.month

In [82]:
sales_final['order_date_month'].value_counts()
sales_final['cost_to_company']=sales_final['shipping_cost']+sales_final['discount']

11    6342
12    6302
9     5975
6     5331
8     5078
10    4490
5     3747
7     3166
4     3057
3     3035
1     2599
2     2168
Name: order_date_month, dtype: int64

In [22]:
sales_final[sales_final['cost_to_company']==max(sales_final['cost_to_company'])]

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,quantity,discount,profit,shipping_cost,order_priority,year,converted_date,category2,order_date_month,cost_to_company
13891,CA-2012-124891,7/31/2012,7/31/2012,Same Day,Rick Hansen,Consumer,New York,United States,US,East,...,7,0.0,762.1845,933.57,Critical,2012,2012-07-31,Trial,7,933.57

In [28]:
# Axis 0 means row and Axis 1 means column we can create more Axis
sales_final.drop(columns='cost_to_company')
# Is Equivalent to
sales_final.drop('cost_to_company',axis=1)
# To drop it permanently use 
sales_final.drop('cost_to_company',axis=1,inplace=True)

In [29]:
sales_final.loc[[2,3]]

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,sales,quantity,discount,profit,shipping_cost,order_priority,year,converted_date,category2,order_date_month
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,66,4,0.0,29.640,8.17,High,2011,2011-01-01,Trial,1
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,45,3,0.5,-26.055,4.82,High,2011,2011-01-01,Trial,1

In [31]:
sales_final.loc[2:10]

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,...,sales,quantity,discount,profit,shipping_cost,order_priority,year,converted_date,category2,order_date_month
2,HU-2011-1220,1/1/2011,1/5/2011,Second Class,Annie Thurman,Consumer,Budapest,Hungary,EMEA,EMEA,...,66,4,0.00,29.6400,8.17,High,2011,2011-01-01,Trial,1
3,IT-2011-3647632,1/1/2011,1/5/2011,Second Class,Eugene Moren,Home Office,Stockholm,Sweden,EU,North,...,45,3,0.50,-26.0550,4.82,High,2011,2011-01-01,Trial,1
4,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,114,5,0.10,37.7700,4.70,Medium,2011,2011-01-01,Trial,1
5,IN-2011-47883,1/1/2011,1/8/2011,Standard Class,Joseph Holt,Consumer,New South Wales,Australia,APAC,Oceania,...,55,2,0.10,15.3420,1.80,Medium,2011,2011-01-01,Trial,1
6,CA-2011-1510,1/2/2011,1/6/2011,Standard Class,Magdelene Morse,Consumer,Ontario,Canada,Canada,Canada,...,314,1,0.00,3.1200,24.10,Medium,2011,2011-01-02,Trial,1
7,IN-2011-79397,1/3/2011,1/3/2011,Same Day,Kean Nguyen,Corporate,New South Wales,Australia,APAC,Oceania,...,276,1,0.10,110.4120,125.32,Critical,2011,2011-01-03,Trial,1
8,ID-2011-80230,1/3/2011,1/9/2011,Standard Class,Ken Lonsdale,Consumer,Auckland,New Zealand,APAC,Oceania,...,912,4,0.40,-319.4640,107.10,Low,2011,2011-01-03,Trial,1
9,IZ-2011-4680,1/3/2011,1/7/2011,Standard Class,Lindsay Williams,Corporate,Ninawa,Iraq,EMEA,EMEA,...,667,4,0.00,253.3200,81.26,High,2011,2011-01-03,Trial,1
10,IN-2011-65159,1/3/2011,1/7/2011,Second Class,Larry Blacks,Consumer,National Capital,Philippines,APAC,Southeast Asia,...,338,3,0.45,-122.8005,33.75,High,2011,2011-01-03,Trial,1

In [35]:

sales_final.loc[2:6,['order_id','order_date','ship_date']]
# loc uses face value for fetching

          order_id order_date ship_date
2     HU-2011-1220   1/1/2011  1/5/2011
3  IT-2011-3647632   1/1/2011  1/5/2011
4    IN-2011-47883   1/1/2011  1/8/2011
5    IN-2011-47883   1/1/2011  1/8/2011
6     CA-2011-1510   1/2/2011  1/6/2011

In [36]:
sales_final.iloc[2:6,0:3]
# ILOC WORKS on internally assigned indexes

          order_id order_date ship_date
2     HU-2011-1220   1/1/2011  1/5/2011
3  IT-2011-3647632   1/1/2011  1/5/2011
4    IN-2011-47883   1/1/2011  1/8/2011
5    IN-2011-47883   1/1/2011  1/8/2011

In [52]:
df=sales_final[sales_final.dtypes[(sales_final.dtypes=='float64') | (sales_final.dtypes=='int64')].index]
df2=df[df>100]

In [59]:
df2.dropna(axis=0,thresh=3)

       quantity  discount    profit  shipping_cost  year  order_date_month
7           NaN       NaN  110.4120         125.32  2011               NaN
27          NaN       NaN  609.8400         109.13  2011               NaN
43          NaN       NaN  999.3600         191.20  2011               NaN
58          NaN       NaN  746.4078         258.99  2011               NaN
84          NaN       NaN  260.8200         275.52  2011               NaN
...         ...       ...       ...            ...   ...               ...
51149       NaN       NaN  899.1000         236.49  2014               NaN
51150       NaN       NaN  317.1600         184.60  2014               NaN
51151       NaN       NaN  768.8800         155.85  2014               NaN
51152       NaN       NaN  314.0384         139.47  2014               NaN
51228       NaN       NaN  301.4660         253.25  2014               NaN

[1941 rows x 6 columns]

In [60]:
df2.fillna(value=0)

       quantity  discount  profit  shipping_cost  year  order_date_month
0           0.0       0.0  106.14            0.0  2011               0.0
1           0.0       0.0    0.00            0.0  2011               0.0
2           0.0       0.0    0.00            0.0  2011               0.0
3           0.0       0.0    0.00            0.0  2011               0.0
4           0.0       0.0    0.00            0.0  2011               0.0
...         ...       ...     ...            ...   ...               ...
51285       0.0       0.0    0.00            0.0  2014               0.0
51286       0.0       0.0    0.00            0.0  2014               0.0
51287       0.0       0.0    0.00            0.0  2014               0.0
51288       0.0       0.0    0.00            0.0  2014               0.0
51289       0.0       0.0    0.00            0.0  2014               0.0

[51290 rows x 6 columns]

In [64]:
sales_final.groupby('year')['profit'].mean()

year
2011    27.666238
2012    28.043722
2013    29.604519
2014    28.758540
Name: profit, dtype: float64

In [65]:
sales_final.groupby('year')['shipping_cost'].mean()

year
2011    27.147264
2012    25.861329
2013    26.418577
2014    26.268197
Name: shipping_cost, dtype: float64

In [66]:
sales_final.groupby('year')['discount'].mean()

year
2011    0.148188
2012    0.141286
2013    0.140265
2014    0.143291
Name: discount, dtype: float64

In [78]:
sales_final.sales=sales_final.sales.str.replace(',','').astype(int)

In [79]:
sales_final.dtypes

order_id                    object
order_date                  object
ship_date                   object
ship_mode                   object
customer_name               object
segment                     object
state                       object
country                     object
market                      object
region                      object
product_id                  object
category                    object
sub_category                object
product_name                object
sales                        int32
quantity                     int64
discount                   float64
profit                     float64
shipping_cost              float64
order_priority              object
year                         int64
converted_date      datetime64[ns]
category2                   object
order_date_month             int64
dtype: object

In [81]:
sales_final.groupby('year')['sales'].mean()
sales_final.groupby('year')['sales'].sum()

year
2011    2259511
2012    2677493
2013    3405860
2014    4300041
Name: sales, dtype: int32